In [1]:
# Pandas

In [73]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([1,2,3,4,5])

In [4]:
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
df1 = pd.DataFrame([
    [4,5,6,6],
    [34,2,55,23]
])

In [9]:
df1

    0  1   2   3
0   4  5   6   6
1  34  2  55  23

In [10]:
df3=pd.DataFrame(
    {
        'english':[38,45,54,44,66],
        'science':[56,76,44,77,78],
        'maths':[78,56,43,77,44]
    })

In [11]:
df3

   english  science  maths
0       38       56     78
1       45       76     56
2       54       44     43
3       44       77     77
4       66       78     44

In [13]:
df3.index=['aman','kamal','karan','zaid','kajal']

In [14]:
df3

       english  science  maths
aman        38       56     78
kamal       45       76     56
karan       54       44     43
zaid        44       77     77
kajal       66       78     44

In [15]:
# list of lists
english = [45,65,66,34,67,43,77,43]
maths   = [89,54,87,56,96,45,89,99]
science = [89,76,87,54,45,67,66,54]
subjects = [english , maths,science]

In [16]:
subjects

[[45, 65, 66, 34, 67, 43, 77, 43],
 [89, 54, 87, 56, 96, 45, 89, 99],
 [89, 76, 87, 54, 45, 67, 66, 54]]

In [35]:
subjects_df = pd.DataFrame(subjects,columns=['aman','kamal','karan','zaid','kajal','raman','john','kirn'],index=['english','math','science'])

In [36]:
subjects_df

         aman  kamal  karan  zaid  kajal  raman  john  kirn
english    45     65     66    34     67     43    77    43
math       89     54     87    56     96     45    89    99
science    89     76     87    54     45     67    66    54

In [37]:
subjects_df = pd.DataFrame(subjects,columns=['aman','kamal','karan','zaid','kajal','raman','john','kirn'],index=['english','math','science']).T
# here t is transpose as previously names was columns and subjects was rows then we transpose

In [38]:
subjects_df

       english  math  science
aman        45    89       89
kamal       65    54       76
karan       66    87       87
zaid        34    56       54
kajal       67    96       45
raman       43    45       67
john        77    89       66
kirn        43    99       54

In [39]:
df1 = df1.T

In [40]:
df1

   0   1
0  4  34
1  5   2
2  6  55
3  6  23

In [53]:
sub_name=['english','maths']
name = ['aman','kamal','karan','zaid']

In [54]:
df1.columns = sub_name

In [55]:
df1.index = name

In [56]:
df1

       english  maths
aman         4     34
kamal        5      2
karan        6     55
zaid         6     23

In [57]:
data = [
    {"name":"raman","age":22,"marks":54},
    {"name":"samar","age":24,"marks":84},
    {"name":"sajan","age":26,"marks":34},
    {"name":"rocky","age":28,"marks":44},
]

In [58]:
data_df= pd.DataFrame(data)

In [59]:
data_df

    name  age  marks
0  raman   22     54
1  samar   24     84
2  sajan   26     34
3  rocky   28     44

In [69]:
data2 = {
   "a":  {"name":"raman","age":22,"marks":54},
   "b": {"name":"samar","age":24,"marks":84},
    "c":{"name":"sajan","age":26,"marks":34},
    "d": {"name":"rocky","age":28,"marks":44},
}

In [70]:
data_2_df=pd.DataFrame(data2)

In [71]:
data_2_df

           a      b      c      d
name   raman  samar  sajan  rocky
age       22     24     26     28
marks     54     84     34     44

In [74]:
new_data = np.array([
    [1,2,3,4],
    [3,4,5,3],
    [9,8,7,5]
])

In [78]:
data_new_df= pd.DataFrame(new_data.T,columns=['a','b','c'])

In [79]:
data_new_df

   a  b  c
0  1  3  9
1  2  4  8
2  3  5  7
3  4  3  5